app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def self.create_for_user_and_long_url!(user_id, long_url)

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "qrKYv2BQS9rGMZnKFyw_-g"], ["LIMIT", 1]]
---
    def self.random_code
        code = SecureRandom.urlsafe_base64(16)
        while ShortenedUrl.exists?(:short_url => code)